In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
df['Age'].fillna(df['Age'].mean(), inplace=True)

C:\Users\Rashidul_Islam\AppData\Local\Temp\ipykernel_8388\1698716155.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)

In [7]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df['first_name'] = df['Name'].apply(lambda x: x.split(', ')[1])

In [10]:
df['last_name'] = df['Name'].apply(lambda x: x.split(', ')[0])

In [11]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen

In [12]:
df['first_name'].apply(lambda x: x.split('.')[1].strip())

0                                Owen Harris
1      John Bradley (Florence Briggs Thayer)
2                                      Laina
3              Jacques Heath (Lily May Peel)
4                              William Henry
                       ...
886                                   Juozas
887                           Margaret Edith
888                 Catherine Helen "Carrie"
889                              Karl Howell
890                                  Patrick
Name: first_name, Length: 891, dtype: object

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen

In [14]:
(df['Sex']==1)

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Sex, Length: 891, dtype: bool

In [15]:
df['Third_&_man'] = ((df['Pclass']==3) & (df['Sex']==0)).astype(int)

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings,0
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen,1

In [17]:
def findAge(age):
    if age < 18:
        return 1
    elif age >= 18 and age < 40:
        return 2
    elif age >= 40 and age < 60:
        return 3
    else:
        return 4
df['Age_group'] = df['Age'].apply(lambda x: findAge(x))
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man,Age_group
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund,1,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings,0,2
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen,0,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle,0,2
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen,1,2

In [18]:
df = df.drop(['PassengerId'], axis=1)
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man,Age_group
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund,1,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings,0,2
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen,0,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle,0,2
4,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen,1,2

In [19]:
df.rename(columns={'Name':'Full_name', 'Sex': 'Gender'}, inplace=True)

In [20]:
df.head()

,Survived,Pclass,Full_name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man,Age_group
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund,1,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings,0,2
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen,0,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle,0,2
4,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen,1,2

In [21]:
df[(df['Age'] > 60) & (df['Gender'] == 1)]

,Survived,Pclass,Full_name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man,Age_group
275,1,1,"Andrews, Miss. Kornelia Theodosia",1,63.0,1,0,13502,77.9583,D7,S,Miss. Kornelia Theodosia,Andrews,0,4
483,1,3,"Turkula, Mrs. (Hedwig)",1,63.0,0,0,4134,9.5875,NaN,S,Mrs. (Hedwig),Turkula,0,4
829,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",1,62.0,0,0,113572,80.0000,B28,NaN,Mrs. George Nelson (Martha Evelyn),Stone,0,4

In [22]:
#Filter only neumerical columns
# neumeric = ['int16', 'int32', 'int64', 'float16', 'float32', 'float64']
df_neu = df.select_dtypes(include=['int16', 'int32', 'int64', 'float16', 'float32', 'float64'])

In [23]:
df_neu.head()

,Survived,Pclass,Gender,Age,SibSp,Parch,Fare,Third_&_man,Age_group
0,0,3,0,22.0,1,0,7.2500,1,2
1,1,1,1,38.0,1,0,71.2833,0,2
2,1,3,1,26.0,0,0,7.9250,0,2
3,1,1,1,35.0,1,0,53.1000,0,2
4,0,3,0,35.0,0,0,8.0500,1,2

In [24]:
df_categorical = df.select_dtypes(include=['object'])
df_categorical.head()

,Full_name,Ticket,Cabin,Embarked,first_name,last_name
0,"Braund, Mr. Owen Harris",A/5 21171,NaN,S,Mr. Owen Harris,Braund
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",PC 17599,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings
2,"Heikkinen, Miss. Laina",STON/O2. 3101282,NaN,S,Miss. Laina,Heikkinen
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",113803,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle
4,"Allen, Mr. William Henry",373450,NaN,S,Mr. William Henry,Allen

In [25]:
#loc and iloc
df_sub1 = df.iloc[1:4, 2:5]
df_sub1.head()

                                           Full_name  Gender   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1  38.0
2                             Heikkinen, Miss. Laina       1  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1  35.0

In [26]:
df.head()

,Survived,Pclass,Full_name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man,Age_group
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund,1,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings,0,2
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen,0,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle,0,2
4,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen,1,2

In [27]:
df.loc[1:10, ['Survived', 'Pclass', 'Gender', 'Age','SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Third_&_man', 'Age_group'] ]

,Survived,Pclass,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Third_&_man,Age_group
1,1,1,1,38.000000,1,0,PC 17599,71.2833,C85,0,2
2,1,3,1,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,0,2
3,1,1,1,35.000000,1,0,113803,53.1000,C123,0,2
4,0,3,0,35.000000,0,0,373450,8.0500,NaN,1,2
5,0,3,0,29.699118,0,0,330877,8.4583,NaN,1,2
6,0,1,0,54.000000,0,0,17463,51.8625,E46,0,3
7,0,3,0,2.000000,3,1,349909,21.0750,NaN,1,1
8,1,3,1,27.000000,0,2,347742,11.1333,NaN,0,2
9,1,2,1,14.000000,1,0,237736,30.0708,NaN,0,1
10,1,3,1,4.000000,1,1,PP 9549,16.7000,G6,0,1

In [29]:
row = dict({'Survived':1, 'Pclass':2, 'Gender':1, 'Age':29, 'SibSp':0, 'Parch':0, 'Ticket':'PC 17599', 'Fare':13.00, 'Cabin':'NaN', 'Embarked':'S', 'first_name':'Mrs. Jane', 'last_name':'Doe', 'Third_&_man':0, 'Age_group':2})
df = pd.concat([df, pd.DataFrame([row])])
df.tail()

,Survived,Pclass,Full_name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man,Age_group
887,1,1,"Graham, Miss. Margaret Edith",1,19.000000,0,0,112053,30.00,B42,S,Miss. Margaret Edith,Graham,0,2
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,29.699118,1,2,W./C. 6607,23.45,NaN,S,"Miss. Catherine Helen ""Carrie""",Johnston,0,2
889,1,1,"Behr, Mr. Karl Howell",0,26.000000,0,0,111369,30.00,C148,C,Mr. Karl Howell,Behr,0,2
890,0,3,"Dooley, Mr. Patrick",0,32.000000,0,0,370376,7.75,NaN,Q,Mr. Patrick,Dooley,1,2
0,1,2,NaN,1,29.000000,0,0,PC 17599,13.00,NaN,S,Mrs. Jane,Doe,0,2

In [35]:
# row = dict({'Survived':1, 'Pclass':2, 'Gender':1, 'Age':29, 'SibSp':0, 'Parch':0, 'Ticket':'PC 17599', 'Fare':13.00, 'Cabin':'NaN', 'Embarked':'S', 'first_name':'Mrs. Jane', 'last_name':'Doe', 'Third_&_man':0, 'Age_group':2})
df = pd.concat([df, pd.DataFrame([row])], ignore_index=True)
df.tail()

,Survived,Pclass,Full_name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man,Age_group
892,1,2,NaN,1,29.0,0,0,PC 17599,13.0,NaN,S,Mrs. Jane,Doe,0,2
893,1,2,NaN,1,29.0,0,0,PC 17599,13.0,NaN,S,Mrs. Jane,Doe,0,2
894,1,2,NaN,1,29.0,0,0,PC 17599,13.0,NaN,S,Mrs. Jane,Doe,0,2
895,1,2,NaN,1,29.0,0,0,PC 17599,13.0,NaN,S,Mrs. Jane,Doe,0,2
896,1,2,NaN,1,29.0,0,0,PC 17599,13.0,NaN,S,Mrs. Jane,Doe,0,2

In [36]:
#remove duplicate rows
df.drop_duplicates(inplace=True)

In [38]:
df.tail()

,Survived,Pclass,Full_name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,last_name,Third_&_man,Age_group
887,1,1,"Graham, Miss. Margaret Edith",1,19.000000,0,0,112053,30.00,B42,S,Miss. Margaret Edith,Graham,0,2
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,29.699118,1,2,W./C. 6607,23.45,NaN,S,"Miss. Catherine Helen ""Carrie""",Johnston,0,2
889,1,1,"Behr, Mr. Karl Howell",0,26.000000,0,0,111369,30.00,C148,C,Mr. Karl Howell,Behr,0,2
890,0,3,"Dooley, Mr. Patrick",0,32.000000,0,0,370376,7.75,NaN,Q,Mr. Patrick,Dooley,1,2
891,1,2,NaN,1,29.000000,0,0,PC 17599,13.00,NaN,S,Mrs. Jane,Doe,0,2